app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "dave"], ["last_name", "goods"], ["created_at", "2017-09-23 18:45:08.309026"], ["updated_at", "2017-09-23 18:45:08.309026"]]
---
  def create
    @student = Student.new(params.require(:student).permit(:first_name, :last_name))
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "esrer"], ["last_name", "sadfwerwer"], ["updated_at", "2017-09-23 20:00:54.635754"], ["id", 11]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(params.require(:student).permit(:first_name, :last_name))